14.1. Представление "инвойсы" тем и отличается от таблизы "заказы", что представляет собой представление, достаточное для формирования платежного документа.
Есть вся необходимая информация, а разделенные логически значения в базе соединены для удобства человеческого восприятия например dbo.Employees.FirstName + ' ' + dbo.Employees.LastName AS Salesperson

14.2. Агрегирует продажи по категориям.

14.3. Выбирает заказы, где размер заказа больше определенного чилса и за указанный период времени

14.4. Выбирает продукты, цена которых выше средней цены в таблице. 

14.5. Выбирает отправленные (завершенные) заказы и сумму по ним. 
